# -*- coding: utf-8 -*-

"""
------------------------------------------------

describe:
    status message

base_info:
    __author__ = "PyGo"
    __time__ = "2022/2/19 10:58 下午"
    __version__ = "v.1.0.0"
    __mail__ = "gaoming971366@163.com"
    __blog__ = "www.pygo2.top"
    __project__ = "open2lsiapi"

usage:

design:

reference urls:

python version:
    python3


Enjoy the good life everyday！！!
Life is short I use python.

------------------------------------------------
"""

# ------------------------------------------------------------
# usage: /usr/bin/python status_msg.py
# ------------------------------------------------------------
from enum import Enum, unique


@unique
class StatusEnum(Enum):
    SUCCESS = 'success'
    FAILURE = 'failure'


# Status message
StatusMsgs = {
    # ** success **
    100: "成功",
    101: "成功，请求数据为空",

    # ** login **
    200: "用户未登录",
    201: "用户不存在",
    202: "用户未注册",
    203: "用户已注销",
    204: "输入的账户/密码有误",
    205: "用户TOKEN验证失败",
    206: "用户输入的旧密码有误",
    207: "输入的两次新密码不一致",

    # ** request method **
    300: "请求方式错误",

    # ** request parameter **
    400: "没有发现请求参数",
    4001: "缺少请求参数",
    4002: "缺少RTX-ID信息",
    401: "请求参数类型不合法",
    402: "请求参数不允许为空",
    403: "请求参数错误",
    # ** request file **
    450: "缺少上传文件",
    451: "文件不存在",
    452: "文件内容不存在",
    453: "文件超过最大65535行数",
    454: "文件格式不支持",
    455: "文件内容不符合要求",
    456: "文件本地存储失败",
    457: "文件云存储失败",
    458: "文件数据已存在",
    459: "文件导出数据为空",
    460: "文件全部上传失败",
    461: "文件部分上传失败",
    462: "文件存储数据库记录失败",
    463: "文件超出操作的SHEET索引",
    464: "文件存储目录不存在",
    465: "文件压缩有误",

    # ** data **
    500: "管理员用户，不允许操作",
    501: "数据不存在",
    502: "数据已存在，不允许新增",
    503: "数据已删除，不允许操作",
    504: "非数据权限人员，无权限操作",

    # ** db **
    600: "数据库异常",
    601: "数据库新增失败",
    602: "数据库删除失败",
    603: "数据库更新失败",
    604: "数据库提交失败",

    # ** other **
    900: "第三方API接口异常",
    901: "HTTP异常",
    999: "未知名异常",

    # ** 自定义异常原因 **
    10000: "自定义异常原因",

}
